# Carga de Datos

Importación de Librería Pandas

In [15]:
import pandas as pd

Versión de Pandas

In [7]:
pd.__version__

'0.25.2'

Carga de Data ( Separación, Fila, encondung)

In [13]:
DF = pd.read_csv('D:\Cursos\Python\AnalisisDeDatos-Py\ArchivosDeDatos\VentasPorVendedor.csv',skiprows=5 ,sep = ';', encoding = 'latin-1')
DF

,Fecha,Vendedor,Región,Artículo,Categoría,Unidades,Ganancia
0,01/01/2016,Steve Ashton,Norte,Medias Femeninas,Vestimenta,6,"$ 18,00"
1,01/01/2016,Trevor Snodgrass,Oeste,Chocolate,Comestibles,8,"$ 3,84"
2,01/01/2016,Sarah Bond,Sur,Gorras,Vestimenta,3,"$ 6,30"
3,01/01/2016,Desmond Delaney,Sur,Sánguche de Queso,Comestibles,9,"$ 14,40"
4,01/01/2016,Desmond Delaney,Este,Chocolate,Comestibles,14,"$ 6,72"
...,...,...,...,...,...,...,...
455,31/01/2016,Sarah Bond,Sur,Bufanda,Vestimenta,6,"$ 16,50"
456,31/01/2016,Dustin Gee,Este,Sandalias,Vestimenta,11,"$ 115,50"
457,31/01/2016,Dustin Gee,Este,Sánguche de Queso,Comestibles,4,"$ 6,40"
458,31/01/2016,Dustin Gee,Norte,Escobillón,Hogar,8,"$ 6,80"
459,31/01/2016,Trevor Snodgrass,Sur,Pepinillo,Comestibles,7,"$ 2,10"

In [19]:
DF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 460 entries, 0 to 459
Data columns (total 7 columns):
Fecha        460 non-null object
Vendedor     460 non-null object
Región       460 non-null object
Artículo     460 non-null object
Categoría    460 non-null object
Unidades     460 non-null int64
Ganancia     460 non-null object
dtypes: int64(1), object(6)
memory usage: 14.4+ KB

Estructura de Datos

* DataFrame
* Series

#DATAFRAME : ES DIMENSINAL, TIENE VARIOS CAMPOS.

In [23]:
DF

,Fecha,Vendedor,Región,Artículo,Categoría,Unidades,Ganancia
0,01/01/2016,Steve Ashton,Norte,Medias Femeninas,Vestimenta,6,"$ 18,00"
1,01/01/2016,Trevor Snodgrass,Oeste,Chocolate,Comestibles,8,"$ 3,84"
2,01/01/2016,Sarah Bond,Sur,Gorras,Vestimenta,3,"$ 6,30"
3,01/01/2016,Desmond Delaney,Sur,Sánguche de Queso,Comestibles,9,"$ 14,40"
4,01/01/2016,Desmond Delaney,Este,Chocolate,Comestibles,14,"$ 6,72"
...,...,...,...,...,...,...,...
455,31/01/2016,Sarah Bond,Sur,Bufanda,Vestimenta,6,"$ 16,50"
456,31/01/2016,Dustin Gee,Este,Sandalias,Vestimenta,11,"$ 115,50"
457,31/01/2016,Dustin Gee,Este,Sánguche de Queso,Comestibles,4,"$ 6,40"
458,31/01/2016,Dustin Gee,Norte,Escobillón,Hogar,8,"$ 6,80"
459,31/01/2016,Trevor Snodgrass,Sur,Pepinillo,Comestibles,7,"$ 2,10"

#SERIES: ES UNA LISTA DE DATOS UNIDEMENSIONALES.

* Formas de regresar los datos :

In [27]:
DF['Vendedor']

0          Steve Ashton
1      Trevor Snodgrass
2            Sarah Bond
3       Desmond Delaney
4       Desmond Delaney
             ...
455          Sarah Bond
456          Dustin Gee
457          Dustin Gee
458          Dustin Gee
459    Trevor Snodgrass
Name: Vendedor, Length: 460, dtype: object

In [28]:
DF.Fecha

0      01/01/2016
1      01/01/2016
2      01/01/2016
3      01/01/2016
4      01/01/2016
          ...
455    31/01/2016
456    31/01/2016
457    31/01/2016
458    31/01/2016
459    31/01/2016
Name: Fecha, Length: 460, dtype: object

In [32]:
DF[['Vendedor','Unidades','Ganancia']]

             Vendedor  Unidades    Ganancia
0        Steve Ashton         6    $ 18,00
1    Trevor Snodgrass         8     $ 3,84
2          Sarah Bond         3     $ 6,30
3     Desmond Delaney         9    $ 14,40
4     Desmond Delaney        14     $ 6,72
..                ...       ...         ...
455        Sarah Bond         6    $ 16,50
456        Dustin Gee        11   $ 115,50
457        Dustin Gee         4     $ 6,40
458        Dustin Gee         8     $ 6,80
459  Trevor Snodgrass         7     $ 2,10

[460 rows x 3 columns]

#Tipos de Datos con Estructuras

In [34]:
type(DF.Fecha)

pandas.core.series.Series

In [35]:
type(DF[['Vendedor','Unidades','Ganancia']])

pandas.core.frame.DataFrame

#Cargando Varias Fuentes de Datos:

* CSV, XLXS, JSON, TXT, SQL


#Carga de archivos de Texto.

In [39]:
import pandas as pd

Ruta = 'D:\Cursos\Python\AnalisisDeDatos-Py\ArchivosDeDatos\Edades.txt'
Edades = pd.read_csv(Ruta, sep = '|')

Edades

     Nombre Apellidos  edad
0  Inocenta    Ortega    53
1    Miriam  Tiburcio    13
2       Roy  Tiburcio    28
3       Eli     Roque    39
4    Javier  Tiburcio    26

In [40]:
type(Edades)

pandas.core.frame.DataFrame

#Carga De Archivo Excel (Xlsx)

Para cargar archivos Excel se necesita instalar la Librería Xlrd. " pip install xlrd "

In [50]:

#Importación Hoja 1
import pandas as pd

Ruta = 'D:\Cursos\Python\AnalisisDeDatos-Py\ArchivosDeDatos\Edades_FormatoExcel.xlsx'

DataFrame = pd.read_excel(Ruta,'Edades')
DataFrame

   Codigo    Nombre Apellidos  edad
0       1  Inocenta    Ortega    53
1       2    Miriam  Tiburcio    13
2       3       Roy  Tiburcio    28
3       4       Eli     Roque    39
4       5    Javier  Tiburcio    26

In [49]:
#Importación Hoja 2

DateFrame2 = pd.read_excel(Ruta, 'Fechas')
DateFrame2

   Codigo FechaNacimiento
0       1      1967-12-28
1       2      2005-12-20
2       3      1991-10-15
3       4      1973-03-27
4       5      1993-09-11

In [52]:
Ruta = 'D:\Cursos\Python\AnalisisDeDatos-Py\ArchivosDeDatos\Productos.Json'
DataFrame3 = pd.read_json(Ruta)

DataFrame3

            Product  Price
0  Desktop Computer    700
1            Tablet    250
2            iPhone    800
3            Laptop   1200

In [53]:
Ruta = 'D:\Cursos\Python\AnalisisDeDatos-Py\ArchivosDeDatos\Productos2.Json'
Dataframe4 = pd.read_json(Ruta)

Dataframe4

                                                               ResultSet
Result                 [{'Title': 'potato jpg', 'Summary': 'Kentang S...
firstResultPosition                                                    1
totalResultsAvailable                                            1827221
totalResultsReturned                                                   2

In [55]:
DataFrame.shape

(5, 4)

In [56]:
DF.shape

(460, 7)

In [60]:
DateFrame2.shape

(5, 2)

In [61]:
DataFrame3.shape

(4, 2)

In [63]:
DF.shape[1]

7

In [64]:
DF.head(3)

,Fecha,Vendedor,Región,Artículo,Categoría,Unidades,Ganancia
0,01/01/2016,Steve Ashton,Norte,Medias Femeninas,Vestimenta,6,"$ 18,00"
1,01/01/2016,Trevor Snodgrass,Oeste,Chocolate,Comestibles,8,"$ 3,84"
2,01/01/2016,Sarah Bond,Sur,Gorras,Vestimenta,3,"$ 6,30"

In [65]:
DF.tail(2)

,Fecha,Vendedor,Región,Artículo,Categoría,Unidades,Ganancia
458,31/01/2016,Dustin Gee,Norte,Escobillón,Hogar,8,"$ 6,80"
459,31/01/2016,Trevor Snodgrass,Sur,Pepinillo,Comestibles,7,"$ 2,10"